# Bonus: Temperature Analysis I

In [57]:
import pandas as pd
import datetime as dt

In [73]:
# "tobs" is "temperature observations"
df = pd.read_csv('Step_1_Climate_Analysis_And_Exploration/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [74]:
# Convert the date column format from string to datetime
df['date']= pd.to_datetime(df['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19550 entries, 0 to 19549
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   station  19550 non-null  object
 1   date     19550 non-null  datetime64[ns]
 2   prcp     18103 non-null  float64
 3   tobs     19550 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 611.1+ KB

In [75]:
# Set the date column as the DataFrame index
df.set_index("date", inplace= True)
df.head()

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73

In [76]:
# Drop the date column
df_no_date = df[["station","prcp","tobs"]]

### Compare June and December data across all years

In [77]:
from scipy import stats

In [78]:
# Filter data for desired months 
df = df[(df.index.month == 6)|(df.index.month == 12)]

In [79]:
# Identify the average temperature for June
df['tobs'][df.index.month == 6].mean()

74.94411764705882

In [81]:
# Identify the average temperature for December
df['tobs'][df.index.month == 12].mean()

71.04152933421226

In [82]:
# Create collections of temperature data
df_june = df['tobs'][df.index.month == 6]
df_dec = df['tobs'][df.index.month == 12]

In [85]:
# Run paired t-test
# Will use unpaired, since there's no reason to assume the first of June matches to the first of Dec. etc, 
# like when a student takes two tests and gets two scores.
stats.ttest_ind(df_june, df_dec)

Ttest_indResult(statistic=31.60372399000329, pvalue=3.9025129038616655e-191)

### Analysis

In [ ]:
# Low p-value, reject null hypothesis that the means are the same. The true mean for temperatures of each month 
#are different.